brew "fish"
brew "starship"
brew "micro" # console editor
brew "fnm" # version manager for node
brew "asdf" # version manager for node and more
brew "ripgrep" # recursive grep
brew "jq" # json manipulation
brew "bat" # cat with colors
brew "fd" # find alternative
brew "zoxide" # smarter cd
brew "fzf" # fuzzy search, integrates with zoxide
brew "eza" # modern ls replacement
brew "lazygit" # git TUI
brew "tree"
brew "rename"
brew "yadm" # config manager
brew "git-delta" # https://github.com/dandavison/delta
brew "tlrc" # tldr.sh

brew "imagemagick"
brew "ffmpeg"

cask "iterm2"
cask "monitorcontrol"
cask "linearmouse"
cask "karabiner-elements"
